---
title: '草莽Erlang ── 37. lists:search'
tags:
  - Erlang
  - Elixir
  - AdventCalendar2023
  - 闘魂
  - アドハラ
private: false
updated_at: '2023-01-25T21:06:08+09:00'
id: 94913b05dc9e7055e323
organization_url_name: fukuokaex
slide: false
---
口で言うより行うことがErlang習得への近道と信じています。

https://qiita.com/mnishiguchi/items/9237780e849d80a85e11

## lists:search/2

[lists:search/2](https://www.erlang.org/doc/man/lists.html#search-2)は真理値返す関数を渡し、その関数が真を返すような値がリスト内にある場合、最初に見つかった値に対して `{value, 見つかった値}`タプルを返します。見つからない場合は `false` を返します。

```
search(fun((term) -> boolean), [term]) -> {value, term} | false
search(見つかったら真理値返す関数, リスト) -> {value, 見つかった値} | false
```

```erlang
> lists:search(fun (X) -> X rem 2 == 0 end, [1, 2, 3, 4]).
{value,2}

> lists:search(fun (X) -> X < 0 end, [1, 2, 3, 4]).
false
```

タプルのリストに対して検索する場合は[lists:keyfind/3](https://www.erlang.org/doc/man/lists.html#keyfind-3)が便利です。

## lists:keyfind/3

```
keyfind(term, integer, [tuple]) -> tuple | false
keyfind(検索ワード, タプルの要素の位置, タプルのリスト) -> 見つかったタプル | false
```

[lists:keyfind/3](https://www.erlang.org/doc/man/lists.html#keyfind-3)はタプルのリストを検索します。指定された位置の要素が検索ワードと等しいタプルを探します。該当するタプルが見つかった場合はそのタプルを、そうでない場合は`false`を返します。

要素の数え方は「１、２、３ぁっダー！」です。例えば最初の要素のインデックスは`1`となります。

https://youtu.be/AWxwmqzbOaw

https://youtu.be/FSz7N5hCltw

https://note.com/awesomey/n/n4d8c355bc8f7

```erlang
> L1 = [{"A",10},{"B",20},{"C",30},{"D",40},{"E",50}].

> lists:keyfind("E", 1, L1).
{"E",50}

> lists:keyfind(30, 2, L1).
{"C",30}

> lists:keyfind(123, 2, L1).
false
```

## lists:keysearch/3

[lists:keysearch/3](https://www.erlang.org/doc/man/lists.html#keysearch-3)という非常に似た関数がありますが、これは後方互換性のために存在しているそうですので忘れてよさそうです。

```bash
> lists:keysearch("E", 1, L1).
{value,{"E",50}}

> lists:keysearch(30, 2, L1).
{value,{"C",30}}
```

## lists:keytake/3

[lists:keytake/3](https://www.erlang.org/doc/man/lists.html#keytake-3)を使うと見つかった要素だけではなく、見つかった要素が除外されたリストも同時に取得できます。

```erlang
> lists:keytake("E", 1, L1).
{value,{"E",50},[{"A",10},{"B",20},{"C",30},{"D",40}]}

> lists:keytake(30, 2, L1).
{value,{"C",30},[{"A",10},{"B",20},{"D",40},{"E",50}]}
```

[listsモジュール](https://www.erlang.org/doc/man/lists.html)には他にもリスト処理のための関数がたくさんあります。

## Elixirにも挑戦したい

闘魂ElixirシリーズとElixir Schoolがオススメです。

https://qiita.com/torifukukaiou/items/3b65e5c04fa8c55f526e

https://elixirschool.com/ja

https://qiita.com/piacerex/items/09876caa1e17169ec5e1
